Revit 2027 API
RebarConstrainedHandle.GetEdgeNumber Method
 If the RebarConstrainedHandle's RebarHandleType is 'Edge', then this function will return the number of the edge that is driven by the handle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetEdgeNumber()
Public Function GetEdgeNumber As Integer
public:
int GetEdgeNumber()
member GetEdgeNumber : unit -> int
Return Value
Int32
 Returns the number of the edge that is driven by the handle.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstrainedHandle is no longer valid. -or- The RebarConstrainedHandle is not of RebarHandleType 'Edge'.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace